# Assignment for Week 6      
(Chapter 8 & 9)

## Purpose:     
This assignment is intended to help you do the following:     
1.	Advance your knowledge on working with strings
2.	Familiarize with regular expression
3.	Use of functions and .apply()

## Action Items:       
•	Working with strings.
1. Clean a column on your data set using 
regular expression methods.      
2. Store the cleaned column into another column of your data set and call it “your_col_name_cleaned”.     

  *Another data set will be provided if your data set is not appropriate to apply regular expression methods.        

•	Use of .apply() 

1.   Create a function that returns the mean, sum, mode, median, and range (separately)      
2.   Run the function into your chosen data set using the .apply() method.     
3.   Post your work on GitHub

In [204]:
import pandas as pd 
import re

In [205]:
data = pd.read_csv('https://raw.githubusercontent.com/frankData612/data_612/master/baseballdatabank-master/core/AllstarFull.csv')

In [206]:
data.head()

    playerID  yearID  gameNum        gameID teamID lgID  GP  startingPos
0  gomezle01  1933.0      0.0  ALS193307060    NYA   AL   1          1.0
1  ferreri01  1933.0      0.0  ALS193307060    BOS   AL   1          2.0
2  gehrilo01  1933.0      0.0  ALS193307060    NYA   AL   1          3.0
3  gehrich01  1933.0      0.0  ALS193307060    DET   AL   1          4.0
4  dykesji01  1933.0      0.0  ALS193307060    CHA   AL   1          5.0

In [207]:
data['your_col_name_cleand'] = data['gameID'].str.extract('(\d\d\d\d\d\d\d\d\d)',expand = True)

In [208]:
data.head(3)

    playerID  yearID  gameNum  ... GP startingPos your_col_name_cleand
0  gomezle01  1933.0      0.0  ...  1         1.0            193307060
1  ferreri01  1933.0      0.0  ...  1         2.0            193307060
2  gehrilo01  1933.0      0.0  ...  1         3.0            193307060

[3 rows x 9 columns]

In [209]:
df = pd.read_csv('https://raw.githubusercontent.com/frankData612/data_612/master/baseballdatabank-master/core/Salaries.csv')
df.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [228]:
def sum(x):
  return x + x

In [230]:
df['salary'].apply(sum)

0         1740000
1         1100000
2         1090000
3         1266666
4         1250000
           ...
26423    20800000
26424     1048000
26425     1049800
26426    43467230
26427    28000000
Name: salary, Length: 26428, dtype: int64

In [ ]:
def mean(x):
  return (x+x)/2

In [212]:
df['salary'].apply(mean)

0        5.800000e+05
1        3.666667e+05
2        3.633333e+05
3        4.222220e+05
4        4.166667e+05
             ...
26423    6.933333e+06
26424    3.493333e+05
26425    3.499333e+05
26426    1.448908e+07
26427    9.333333e+06
Name: salary, Length: 26428, dtype: float64

In [ ]:
def rang(x):
   for i in range(6):
     return (i)

In [213]:
df['salary'].apply(rang)

0        0
1        0
2        0
3        0
4        0
        ..
26423    0
26424    0
26425    0
26426    0
26427    0
Name: salary, Length: 26428, dtype: int64